examples/of7_8/kOmegaSST/system/controlDict
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000; //note endTime does not trigger writing of results

deltaT          1;

writeControl    timeStep;

writeInterval   5000;

purgeWrite      1; //number of checkpoints to retain. e.g. 0 retains all checkpoints, 5 retains only the last 5 checkpoints.

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
  // "myLibABL.so"
  "myLibABLkOmegaSST.so"
 );

functions
{
  #includeFunc residuals
  #includeFunc  inletGraph
  #includeFunc  incidentGraph
}


// ************************************************************************* //
