examples/of7_8/kOmegaSST/0/include/sideAndTopPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

top
{
    type zeroGradient;
}

sides_1
{
    type empty;
}

sides_2
{
    type empty;
}

"proc.*"
{
    type            processor;
}

// ************************************************************************* //
